# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'lazydocker'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh-completions'
brew 'zsh'
brew 'svn'

# Development
brew 'imagemagick'
brew 'node'
brew 'yarn'


# Apps

## Basics
cask 'arq'
cask 'bartender'
cask 'google-chrome'
cask 'little-snitch'
cask 'flux'
cask 'keepingyouawake'
cask 'slack'
cask 'mimestream'
cask 'soulver'
mas '1Password', id: 1333542190
mas 'Telegram', id: 747648890 
mas 'The Unarchiver', id: 425424353
mas 'Things', id: 904280696

## Dev
cask 'iterm2'
cask 'docker'
cask 'tableplus'
cask 'visual-studio-code'
cask 'paw'
cask 'postico'
cask 'tor-browser'
cask 'firefox'
cask 'github'

## Design
cask 'figma'
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456



# Quicklook
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
